import '../models/nakath_event.dart';

final List<NakathEvent> nakathEvents = [
  NakathEvent(
    title: 'නව සඳ බැලීමය',
    dateTime: DateTime(2025, 3, 30, 00, 00),
    description:
        'අභිනව චන්ද්‍ර වර්ෂය සඳහා: මාර්තු මස 30 වැනි ඉරිදා අභිනව සූර්ය වර්ෂය සඳහා: මැයි මස 01 වැනි බ්‍රහස්පතින්දා නව සඳ බැලීම සුභදායක වේ.',
  ),
  NakathEvent(
    title: 'පරණ අවුරුද්ද සඳහා ස්නානය',
    dateTime: DateTime(2025, 4, 13, 00, 00),
    description:
        'අප්‍රේල් මස 13 වැනි ඉරිදා දිවුල්පත් යුෂ මිශ්‍ර නානු ගා ස්නානය කොට ඉෂ්ට දේවතා අනුස්මරණයෙහි යෙදී වාසය මැනවි.',
  ),
  NakathEvent(
    title: 'අලුත් අවුරුදු උදාව',
    dateTime: DateTime(2025, 4, 14, 3, 21),
    description:
        'අප්‍රේල් මස 14 වැනි සඳුදා පූර්ව භාග 03.21 ට සිංහල අලුත් අවුරුද්ද උදාවෙයි.',
  ),
  NakathEvent(
    title: 'පුන්‍ය කාලය (නොනගතය)',
    dateTime: DateTime(2025, 4, 13, 20, 57),
    description:
        'අප්‍රේල් මස 13 වැනි ඉරිදා අපර භාග 08.57 සිට අප්‍රේල් මස 14 වැනි සඳුදා පූර්ව භාග 09.45 දක්වා පුණ්‍ය කාලය බැවින්, අප්‍රේල් මස 13 වැනි ඉරිදා අපර භාග 08.57 ට පළමුව ආහාර පාන ගෙන සියලු වැඩ අත්හැර ආගමික වතාවත්වල යෙදීම මැනවි.',
  ),
  
  NakathEvent(
    title: 'ආහාර පිසීම',
    dateTime: DateTime(2025, 4, 14, 04, 04),
    description:
        'අප්‍රේල් මස 14 වැනි සඳුදා පූර්ව භාග 04.04 ට තඹ වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා ළිප් බැඳ ගිනි මොළවා කිරිබතක් ද, කැවිලි වර්ගයක් ද දී කිරි සහ විළඳ ද පිළියෙල කර ගැනීම මැනවි.',
  ),
  NakathEvent(
    title: 'වැඩ ඇල්ලීම, ගනුදෙනු කිරීම හා ආහාර අනුභවය',
    dateTime: DateTime(2025, 4, 14, 06, 44),
    description:
        'අප්‍රේල් මස 14 වැනි සඳුදා පූර්ව භාග 06.44 ට මුතු හා ශ්වේත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා සියලු වැඩ අල්ලා ගනුදෙනු කොට ආහාර අනුභවය කිරීම මැනවි.',
  ),
  NakathEvent(
    title: 'හිසතෙල් ගෑම',
    dateTime: DateTime(2025, 4, 16, 09, 04),
    description:
        'අප්‍රේල් මස 16 වැනි බදාදා පූර්ව භාග 09.04 ට පච්ච හෙවත් කොළ පැහැති වස්ත්‍රාභරණයෙන් සැරසී උතුරු දිශාව බලා හිසට කොහොඹ පත් ද, පයට කොළොන් පත් ද තබා කොහොඹ පත් යුෂ මිශ්‍ර නානු ද තෙල් ද ගා ස්නානය කිරීම මැනවි.',
  ),
  NakathEvent(
    title: 'රැකී රක්ෂා සඳහා පිටත්ව යෑම.',
    dateTime: DateTime(2025, 4, 17, 09, 03),
    description:
        'රන් පැහැති වස්ත්‍රාභරණයෙන් සැරසී උතුරු දිශාව බලා කිරිබතක් සහ කැවිලි අනුභව කරමින් පිටත්ව යාම.',
  ),
];
